ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
void applyBridgeStatus(const char* line)
{
  int values[5] = { bridgeLastSeq, bridgeArmed ? 1 : 0, bridgeEstop ? 1 : 0, bridgeLeftMicros, bridgeRightMicros };
  if (!parseCsvIntegers(line, values, 5))
    return;

  bridgeLastSeq = values[0];
  bridgeArmed = values[1] != 0;
  bridgeEstop = values[2] != 0;
  bridgeLeftMicros = clampPulse(values[3]);
  bridgeRightMicros = clampPulse(values[4]);
}

void applyBridgeProbeStatus(const char* line)
{
  int values[3] = { bridgeLastSeq, bridgeProbeDirection, bridgeProbeSpeed };
  if (!parseCsvIntegers(line, values, 3))
    return;

  bridgeLastSeq = values[0];
  bridgeProbeDirection = constrain(values[1], -1, 1);
  bridgeProbeSpeed = constrain(values[2], 0, 255);
}

void applyBridgeSensorStatus(const char* line)
{
  if (line[0] != 'R' || line[1] != ',')
    return;

  const char* payload = line + 2;
  if (payload[0] == 'P' && payload[1] == ',')
    payload += 2;

  float values[16] = {};
  if (!parseCsvFloats(payload, values, 16))
  {
    Serial.print(F("Ignored malformed sensor line: "));
    Serial.println(line);
    return;
  }

  sensorReceived = true;
  lastSensorAt = millis();
  sensorSeq = static_cast<int>(values[0]);
  sensorTemperatureC = values[1];
  sensorTempRawGpio = static_cast<int>(values[2]);
  sensorTurbidityRaw = static_cast<int>(values[3]);
  sensorTurbidityVoltage = values[4];
  sensorPhRaw = static_cast<int>(values[5]);
  sensorPhVoltage = values[6];
  sensorDistanceCm = values[7];
  sensorDissolvedOxygenRaw = static_cast<int>(values[8]);
  sensorDissolvedOxygenVoltage = values[9];
  sensorTdsRaw = static_cast<int>(values[10]);
  sensorTdsVoltage = values[11];
  sensorUvRaw = static_cast<int>(values[12]);
  sensorUvVoltage = values[13];
  sensorLightRaw = static_cast<int>(values[14]);
  sensorLightVoltage = values[15];

  Serial.print(F("Sensor packet seq="));
  Serial.println(sensorSeq);

  if (hasSocketClient())
    sendSensorBroadcast();
}

void sendBridgeCommand()
{
  if (!kUseArduinoBridge)
    return;

  char line[kMaxBridgeCommandLength];
  const int length = snprintf(
    line,
    sizeof(line),
    "D,%d,%d,%d,%d,%d\n",
    lastSeq,
    armed ? 1 : 0,
    estop ? 1 : 0,
    leftMicros,
    rightMicros);

  if (length > 0 && static_cast<size_t>(length) < sizeof(line) && writeBridgeLine(line))
    lastBridgeCommandAt = millis();
}

void sendBridgeProbeCommand()
{
  if (!kUseArduinoBridge)
    return;

  char line[kMaxBridgeCommandLength];
  const int length = snprintf(
    line,
    sizeof(line),
    "W,%d,%d,%d\n",
    lastSeq,
    probeDirection,
    probeSpeed);

  if (length > 0 && static_cast<size_t>(length) < sizeof(line) && writeBridgeLine(line))
    lastProbeBridgeCommandAt = millis();
}

bool writeBridgeLine(const char* line)
{
  const size_t length = strlen(line);
  const size_t written = BridgeSerial.write(
    reinterpret_cast<const uint8_t*>(line),
    length);
  BridgeSerial.flush();

  if (written == length)
    return true;

  Serial.print(F("Bridge UART short write. Expected="));
  Serial.print(length);
  Serial.print(F(" wrote="));
  Serial.println(written);
  return false;
}

void stopProbe(const char* reason)
{
  probeDirection = 0;
  probeSpeed = 0;
  lastProbeCommandAt = 0;
  sendBridgeProbeCommand();
  if (hasSocketClient())
    sendStatusBroadcast();

  Serial.printf("Probe stopped: %s\n", reason);
}

void neutralize(const char* reason)
{
  armed = false;
  lastNeutralizeReason = reason;
  neutralizeCount++;
  leftMicros = kNeutralMicros;
  rightMicros = kNeutralMicros;
  probeDirection = 0;
  probeSpeed = 0;
  lastCommandAt = 0;
  lastProbeCommandAt = 0;

  applyEscOutputs(leftMicros, rightMicros);
  sendBridgeCommand();
  sendBridgeProbeCommand();
  if (hasSocketClient())
    sendStatusBroadcast();

  Serial.printf("Neutralized: %s\n", reason);
}

void updateTelemetry()
{
  updateGps();
  updateBattery();
}

void updateGps()
{
#if AQUASCAN_HAS_TINYGPS
  size_t processed = 0;
  while (GpsSerial.available() > 0 && processed < kGpsReadBudget)
  {
    gps.encode(static_cast<char>(GpsSerial.read()));
    processed++;
  }

  if (gps.location.isValid() && gps.location.isUpdated())
  {
    gpsFix = true;
    latitude = gps.location.lat();
    longitude = gps.location.lng();
    lastGpsFixAt = millis();
  }

  if (gps.altitude.isValid())
    altitudeMeters = gps.altitude.meters();
  if (gps.course.isValid())
    headingDeg = gps.course.deg();
  if (gps.speed.isValid())
    speedMps = gps.speed.mps();

  if (gpsFix && millis() - lastGpsFixAt > kGpsFreshMs)
    gpsFix = false;
#endif
}

void updateBattery()
{
  if (kBatterySensePin < 0)
    return;

  const unsigned long now = millis();
  if (now - lastBatterySampleAt < kBatterySampleIntervalMs)
    return;

  lastBatterySampleAt = now;
  const int raw = analogRead(kBatterySensePin);
  const float sensedVoltage = (static_cast<float>(raw) / kAdcMaxValue) * kAdcReferenceVoltage;
  batteryVoltage = sensedVoltage * kBatteryDividerScale;
  batteryPercent = constrain(((batteryVoltage - kBatteryEmptyVoltage) / (kBatteryFullVoltage - kBatteryEmptyVoltage)) * 100.0f, 0.0f, 100.0f);
}

void sendStatus(uint8_t clientNum)
{
  String message = buildStatusJson();
  webSocket.sendTXT(clientNum, message);
}

void sendStatusBroadcast()
{
  String message = buildStatusJson();
  webSocket.broadcastTXT(message);
}

void sendSensorBroadcast()
{
  String message = buildSensorJson();
  webSocket.broadcastTXT(message);
}

String buildStatusJson()
{
  String message;
  message.reserve(640);
  message += F("{\"type\":\"status\"");
  message += F(",\"connected\":");
  message += (hasSocketClient() ? F("true") : F("false"));
  message += F(",\"armed\":");
  message += (armed ? F("true") : F("false"));
  message += F(",\"estop\":");
  message += (estop ? F("true") : F("false"));
  message += F(",\"lastSeq\":");
  message += lastSeq;
  message += F(",\"left\":");
  message += leftMicros;
  message += F(",\"right\":");
  message += rightMicros;
  message += F(",\"lastNeutralizeReason\":\"");
  message += escapeJson(lastNeutralizeReason);
  message += F("\",\"neutralizeCount\":");
  message += neutralizeCount;
  message += F(",\"probeDirection\":\"");
  message += probeDirection > 0 ? F("lower") : probeDirection < 0 ? F("raise") : F("stop");
  message += F("\",\"probeSpeed\":");
  message += probeSpeed;
  message += F(",\"rssi\":");
  message += (WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : -1);

  if (gpsFix)
  {
    appendJsonNumber(message, "latitude", latitude, 7);
    appendJsonNumber(message, "longitude", longitude, 7);
    appendJsonNumber(message, "altitude", altitudeMeters, 2);
    appendJsonNumber(message, "headingDeg", headingDeg, 1);
    appendJsonNumber(message, "speedMps", speedMps, 2);
  }

  if (!isnan(batteryPercent))
  {
    appendJsonNumber(message, "batteryPercent", batteryPercent, 1);
    appendJsonNumber(message, "batteryVoltage", batteryVoltage, 2);
  }

  if (sensorReceived)
    appendSensorJsonFields(message);

  message += '}';
  return message;
}

