ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
String buildSensorJson()
{
  String message;
  message.reserve(360);
  message += F("{\"type\":\"sensor\"");
  message += F(",\"connected\":");
  message += (hasSocketClient() ? F("true") : F("false"));
  appendSensorJsonFields(message);
  message += '}';
  return message;
}

void sendMissionAck(uint8_t clientNum, const String& missionId, int seq, bool accepted, const String& text)
{
  String message;
  message.reserve(160);
  message += F("{\"type\":\"mission_upload_ack\",\"missionId\":\"");
  message += escapeJson(missionId);
  message += F("\",\"seq\":");
  message += seq;
  message += F(",\"accepted\":");
  message += (accepted ? F("true") : F("false"));
  message += F(",\"message\":\"");
  message += escapeJson(text);
  message += F("\"}");
  webSocket.sendTXT(clientNum, message);
}

void sendMissionProgress(uint8_t clientNum)
{
  if (uploadMissionId.length() == 0)
    return;

  String message;
  message.reserve(180);
  message += F("{\"type\":\"mission_upload_progress\",\"missionId\":\"");
  message += escapeJson(uploadMissionId);
  message += F("\",\"receivedWaypoints\":");
  message += uploadReceivedWaypoints;
  message += F(",\"waypointCount\":");
  message += uploadWaypointCount;
  if (uploadChecksum.length() > 0)
  {
    message += F(",\"checksum\":\"");
    message += escapeJson(uploadChecksum);
    message += F("\"");
  }
  message += '}';
  webSocket.sendTXT(clientNum, message);
}

bool hasSocketClient()
{
  return connectedClientCount > 0;
}

void markSocketConnected(uint8_t clientNum)
{
  if (clientNum >= kTrackedSocketSlots)
  {
    if (connectedClientCount == 0)
      connectedClientCount = 1;
    return;
  }

  if (!socketSlots[clientNum])
  {
    socketSlots[clientNum] = true;
    connectedClientCount++;
  }
}

void markSocketDisconnected(uint8_t clientNum)
{
  if (clientNum >= kTrackedSocketSlots)
  {
    if (connectedClientCount > 0)
      connectedClientCount--;
    return;
  }

  if (socketSlots[clientNum])
  {
    socketSlots[clientNum] = false;
    if (connectedClientCount > 0)
      connectedClientCount--;
  }
}

bool parseCsvIntegers(const char* line, int* values, int expectedCount)
{
  if (line[1] != ',')
    return false;

  const char* cursor = line + 2;
  for (int i = 0; i < expectedCount; i++)
  {
    char* endPointer = nullptr;
    const long parsed = strtol(cursor, &endPointer, 10);

    if (endPointer == cursor)
      return false;

    values[i] = static_cast<int>(parsed);

    if (i == expectedCount - 1)
      return *endPointer == '\0';

    if (*endPointer != ',')
      return false;

    cursor = endPointer + 1;
  }

  return true;
}

bool parseCsvFloats(const char* line, float* values, int expectedCount)
{
  const char* cursor = line;

  for (int i = 0; i < expectedCount; i++)
  {
    char* endPointer = nullptr;
    const float parsed = strtof(cursor, &endPointer);

    if (endPointer == cursor)
      return false;

    values[i] = parsed;

    if (i == expectedCount - 1)
      return *endPointer == '\0';

    if (*endPointer != ',')
      return false;

    cursor = endPointer + 1;
  }

  return true;
}

int clampPulse(int value)
{
  if (value < kMinMicros)
    return kMinMicros;
  if (value > kMaxMicros)
    return kMaxMicros;
  return value;
}

String socketPayloadToString(const char* payload, size_t length)
{
  String message;
  message.reserve(length + 1);
  for (size_t i = 0; i < length; i++)
    message += payload[i];
  return message;
}

String readJsonString(const String& message, const char* key, const String& fallback)
{
  int index = findJsonValueStart(message, key);
  if (index < 0 || index >= static_cast<int>(message.length()) || message[index] != '"')
    return fallback;

  index++;
  String value;
  while (index < static_cast<int>(message.length()))
  {
    const char current = message[index++];
    if (current == '"')
      return value;
    if (current == '\\' && index < static_cast<int>(message.length()))
      value += message[index++];
    else
      value += current;
  }

  return fallback;
}

bool readJsonBool(const String& message, const char* key, bool fallback)
{
  const int index = findJsonValueStart(message, key);
  if (index < 0)
    return fallback;

  if (message.startsWith("true", index))
    return true;
  if (message.startsWith("false", index))
    return false;
  return fallback;
}

int readJsonInt(const String& message, const char* key, int fallback)
{
  const int index = findJsonValueStart(message, key);
  if (index < 0)
    return fallback;

  char* endPointer = nullptr;
  const char* start = message.c_str() + index;
  const long parsed = strtol(start, &endPointer, 10);
  if (endPointer == start)
    return fallback;

  return static_cast<int>(parsed);
}

float readJsonFloat(const String& message, const char* key, float fallback)
{
  const int index = findJsonValueStart(message, key);
  if (index < 0)
    return fallback;

  char* endPointer = nullptr;
  const char* start = message.c_str() + index;
  const float parsed = strtof(start, &endPointer);
  if (endPointer == start)
    return fallback;

  return parsed;
}

int findJsonValueStart(const String& message, const char* key)
{
  String pattern = "\"";
  pattern += key;
  pattern += "\"";

  int index = message.indexOf(pattern);
  if (index < 0)
    return -1;

  index = message.indexOf(':', index + pattern.length());
  if (index < 0)
    return -1;

  index++;
  while (index < static_cast<int>(message.length()) && isspace(static_cast<unsigned char>(message[index])))
    index++;

  return index;
}

String escapeJson(const String& value)
{
  String escaped;
  escaped.reserve(value.length());
  for (int i = 0; i < static_cast<int>(value.length()); i++)
  {
    const char current = value[i];
    if (current == '"' || current == '\\')
      escaped += '\\';
    escaped += current;
  }
  return escaped;
}

void appendSensorJsonFields(String& message)
{
  if (!sensorReceived)
    return;

  const unsigned long sensorAgeMs = millis() - lastSensorAt;
  message += F(",\"sensorFresh\":");
  message += sensorAgeMs <= kSensorFreshMs ? F("true") : F("false");
  message += F(",\"sensorAgeMs\":");
  message += sensorAgeMs;
  message += F(",\"sensorSeq\":");
  message += sensorSeq;
  message += F(",\"tempRawGpio\":");
  message += sensorTempRawGpio;
  message += F(",\"turbidityRaw\":");
  message += sensorTurbidityRaw;
  message += F(",\"phRaw\":");
  message += sensorPhRaw;
  message += F(",\"dissolvedOxygenRaw\":");
  message += sensorDissolvedOxygenRaw;
  message += F(",\"tdsRaw\":");
  message += sensorTdsRaw;
  message += F(",\"uvRaw\":");
  message += sensorUvRaw;
  message += F(",\"lightRaw\":");
  message += sensorLightRaw;

  if (!isnan(sensorTemperatureC))
    appendJsonNumber(message, "temperatureC", sensorTemperatureC, 2);
  if (!isnan(sensorTurbidityVoltage))
    appendJsonNumber(message, "turbidityVoltage", sensorTurbidityVoltage, 3);
  if (!isnan(sensorPhVoltage))
    appendJsonNumber(message, "phVoltage", sensorPhVoltage, 3);
  if (!isnan(sensorDistanceCm))
    appendJsonNumber(message, "distanceCm", sensorDistanceCm, 1);
  if (!isnan(sensorDissolvedOxygenVoltage))
    appendJsonNumber(message, "dissolvedOxygenVoltage", sensorDissolvedOxygenVoltage, 3);
  if (!isnan(sensorTdsVoltage))
    appendJsonNumber(message, "tdsVoltage", sensorTdsVoltage, 3);
  if (!isnan(sensorUvVoltage))
    appendJsonNumber(message, "uvVoltage", sensorUvVoltage, 3);
  if (!isnan(sensorLightVoltage))
    appendJsonNumber(message, "lightVoltage", sensorLightVoltage, 3);
}

void appendJsonNumber(String& json, const char* key, double value, int decimals)
{
  json += F(",\"");
  json += key;
  json += F("\":");
  json += String(value, decimals);
}

void startNetwork()
{
  WiFi.persistent(false);
  WiFi.setSleep(false);
  startFallbackAccessPoint();
}

bool connectToRouter()
{
  if (String(kStaSsid) == "YOUR_ROUTER_SSID" || String(kStaPassword) == "YOUR_ROUTER_PASSWORD" || strlen(kStaSsid) == 0)
  {
    Serial.println(F("Router credentials not configured. Starting fallback AP."));
    return false;
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin(kStaSsid, kStaPassword);

  Serial.printf("Connecting to router SSID '%s'", kStaSsid);
  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startedAt < kStaConnectTimeoutMs)
  {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println(F("Router connection failed."));
    WiFi.disconnect(true, true);
    return false;
  }

  Serial.print(F("Router connected. ESP32 IP: "));
  Serial.println(WiFi.localIP());
  return true;
}

void startFallbackAccessPoint()
{
  WiFi.mode(WIFI_AP);
  WiFi.softAP(kApSsid, kApPassword);
  Serial.print(F("Fallback AP started. SSID: "));
  Serial.println(kApSsid);
  Serial.print(F("Fallback AP IP: "));
  Serial.println(WiFi.softAPIP());
}
